# Arithmetic Operations

In [3]:
import pandas as pd

var = pd.DataFrame({"A": [1,2,3],"B":[4,5,6],"C": [7,8,9]})
var

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [6]:
# Column-wise Operations :

var["D"] = var["A"] + var["B"]
var["E"] = var["A"] - var["B"]
var["F"] = var["A"] * var["B"]
var["G"] = var["A"] / var["B"]

var

   A  B  C  D  E   F     G
0  1  4  7  5 -3   4  0.25
1  2  5  8  7 -3  10  0.40
2  3  6  9  9 -3  18  0.50

In [9]:
# Logical Operations :

var1 = pd.DataFrame({"A": [10,20,30],"B":[40,50,60],"C": [70,80,90]})

var1["PyA"] = var1["A"] <=20

var1["PyB"] = var1["A" and "B"] <= 30

var1["PyC"] = var1["A" or "B"] <= 30

var1

    A   B   C    PyA    PyB   PyC
0  10  40  70   True  False  True
1  20  50  80   True  False  True
2  30  60  90  False  False  True

In [12]:
# Element-wise Operations  :

var1 = pd.DataFrame({"A": [10,20,30],"B":[40,50,60],"C": [70,80,90]})

var1["Mul2"] = var1["A"]*2
var1["Mul3"] = var1["B"]*3.0
var1

    A   B   C  Mul2   Mul3
0  10  40  70    20  120.0
1  20  50  80    40  150.0
2  30  60  90    60  180.0

In [14]:
# Operations on Entire DataFrame  :

var1 = pd.DataFrame({"A": [10,20,30],"B":[40,50,60],"C": [70,80,90]})

var1 + 300

     A    B    C
0  310  340  370
1  320  350  380
2  330  360  390

In [ ]:
# Between Two DataFrames / Series  :

var1 = pd.DataFrame({"A": [10,20,30],"B":[40,50,60],"C": [70,80,90]})
var3 = pd.DataFrame({"A": [100,200,300],"B":[400,500,600],"C": [700,800,900]})

var1 + var3

# Using Pandas Built-in Methods  :

# var1["A"].add(var3["B"], fill_value=0) 

var1["A"].mul(var1["B"], fill_value=0)

0     400
1    1000
2    1800
dtype: int64